<?php

require_once dirname(__DIR__) . '/vendor/autoload.php';




// a. Синтаксис PHP:
// Створіть PHP-скрипт, який виводить привітання "Hello, PHP!".

d("Hello world");

// b. Змінні та типи даних:
// Оголосіть змінну $name та присвойте їй ваше ім'я. Виведіть "Привіт, [ім'я]!".

$name = "Illia";

d("Привіт: $name");

// Створіть змінні для числа та рядка, виконайте операції додавання та виведіть результат.

$int = 10;
$string = "Hello";

d( $string . $int);

// c. Умови та цикли:
// Напишіть умову, що перевіряє, чи число парне чи непарне.



// Використайте цикл for для виведення чисел від 1 до 5.
// d. Функції та масиви:
// Створіть функцію, яка повертає суму двох чисел, переданих як параметри.
// Створіть масив з кількох елементів (наприклад, назви кольорів) і виведіть їх.